src/main/resources/bseXmlRequests/mfUploadFilePasswordRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org/" xmlns:star="http://schemas.datacontract.org/2004/07/StarMFFileUploadService">
     <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:To>http://bsestarmfdemo.bseindia.com/StarMFFileUploadService/StarMFFileUploadService.svc/Basic</wsa:To>
		<wsa:Action>http://tempuri.org/IStarMFFileUploadService/GetPassword</wsa:Action>
	</soap:Header>
   <soap:Body>
      <tem:GetPassword>
         <!--Optional:-->
         <tem:Param>
            <!--Optional:-->
            <star:MemberId>?</star:MemberId>
            <!--Optional:-->
            <star:Password>?</star:Password>
            <!--Optional:-->
            <star:UserId>?</star:UserId>
         </tem:Param>
      </tem:GetPassword>
   </soap:Body>
</soap:Envelope>